{
  "type": "Dua",
  "items": [
    {
      "title": "صبح جاگنے کی دعا",
      "dua": "الْـحَمْـدُ للهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
      "translation": "تمام تعریفیں اللہ کے لیے ہیں جس نے ہمیں موت کے بعد زندگی عطا فرمائی، اور اسی کی طرف لوٹ کر جانا ہے۔"
    },
    {
      "title": "سونے سے پہلے کی دعا",
      "dua": "اللَّهُمَّ بِاسْمِكَ أَمُوتُ وَأَحْيَا",
      "translation": "اے اللہ! تیرے نام کے ساتھ ہی مرتا ہوں اور جیتا ہوں۔"
    },
    {
      "title": "گھر میں داخل ہونے کی دعا",
      "dua": "بِسْمِ اللَّهِ وَلَجْنَا وَبِسْمِ اللَّهِ خَرَجْنَا وَعَلَى اللَّهِ رَبِّنَا تَوَكَّلْنَا",
      "translation": "اللہ کے نام سے ہم داخل ہوئے، اور اللہ کے نام سے ہی ہم باہر نکلے، اور ہم نے اپنے رب اللہ پر بھروسا کیا۔"
    },
    {
      "title": "گھر سے نکلنے کی دعا",
      "dua": "بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
      "translation": "اللہ کے نام کے ساتھ، میں نے اللہ پر بھروسا کیا، اور نہ کسی کی طاقت ہے اور نہ قوت مگر اللہ کے ساتھ۔"
    },
    {
      "title": "کھانے سے پہلے کی دعا",
      "dua": "بِسْمِ اللَّهِ وَعَلَى بَرَكَةِ اللَّهِ",
      "translation": "اللہ کے نام کے ساتھ اور اللہ کی برکت کے ساتھ۔"
    },
    {
      "title": "کھانے کے بعد کی دعا",
      "dua": "الْـحَمْـدُ للهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِينَ",
      "translation": "تمام تعریفیں اللہ کے لیے ہیں جس نے ہمیں کھلایا پلایا اور ہمیں مسلمان بنایا۔"
    },
    {
      "title": "سفر کی دعا",
      "dua": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَىٰ رَبِّنَا لَمُنقَلِبُونَ",
      "translation": "پاک ہے وہ ذات جس نے اسے ہمارے لیے تابع کر دیا، ورنہ ہم خود اس پر قابو پانے والے نہ تھے، اور بے شک ہمیں اپنے رب کی طرف لوٹ کر جانا ہے۔"
    },
    {
      "title": "غصے کے وقت کی دعا",
      "dua": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
      "translation": "میں شیطان مردود سے اللہ کی پناہ مانگتا ہوں۔"
    },
    {
      "title": "وضو کے بعد کی دعا",
      "dua": "أَشْهَدُ أَنْ لَا إِلٰهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
      "translation": "میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں، اور میں گواہی دیتا ہوں کہ محمد صلی اللہ علیہ وسلم اس کے بندے اور رسول ہیں۔"
    },
    {
      "title": "نماز کے بعد کی دعا (مختصر)",
      "dua": "اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ",
      "translation": "اے اللہ! تو ہی سلامتی ہے اور تجھ ہی سے سلامتی ہے، تو برکت والا ہے اے بزرگی اور عزت والے۔"
    }
	 ]
	}
