[
  {
    "title": "سفر کی دعا",
    "dua": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَىٰ رَبِّنَا لَمُنقَلِبُونَ",
    "translation": "پاک ہے وہ ذات جس نے اسے ہمارے لیے تابع کر دیا، ورنہ ہم خود اس پر قابو پانے والے نہ تھے، اور بے شک ہمیں اپنے رب کی طرف لوٹ کر جانا ہے۔",
    "detail": "جب بھی ہم کسی سواری پر سوار ہوتے ہیں... یہ دعا ہمیں شکر، عاجزی اور آخرت کی یاد دلاتی ہے۔"
  },
  {
    "title": "توبہ کی دعا",
    "dua": "رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ",
    "translation": "اے میرے رب! مجھے بخش دے اور میری توبہ قبول فرما، بے شک تو ہی بہت زیادہ توبہ قبول کرنے والا اور مہربان ہے۔",
    "detail": "یہ دعا ہر اس شخص کے لیے ہے جو اپنے گناہوں پر نادم ہو کر اللہ کی طرف رجوع کرتا ہے... اور توبہ کا دروازہ ہر وقت کھلا ہے۔"
  },
  {
    "title": "صبح بیدار ہونے کی دعا",
    "dua": "الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
    "translation": "تمام تعریف اللہ کے لیے ہے جس نے ہمیں موت کے بعد زندگی دی، اور اسی کی طرف ہمیں لوٹنا ہے۔",
    "detail": "صبح کے وقت جاگتے ہی یہ دعا ہمیں سکھاتی ہے... دن کا آغاز کرنے کی بہترین مثال ہے۔"
  },
  {
    "title": "رات کو سوتے وقت کی دعا",
    "dua": "اللَّهُمَّ بِاسْمِكَ أَمُوتُ وَأَحْيَا",
    "translation": "اے اللہ! میں تیرے نام پر ہی مرتا ہوں اور تیرے نام پر ہی زندہ ہوتا ہوں۔",
    "detail": "جب انسان سونے کے لیے لیٹتا ہے تو یہ دعا پڑھ کر خود کو اللہ کے سپرد کر دیتا ہے... دعا کے ساتھ سوتے ہیں۔"
  },
  {
    "title": "مشکل وقت میں پڑھی جانے والی دعا",
    "dua": "حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
    "translation": "اللہ ہمارے لیے کافی ہے، اور وہی بہترین کارساز ہے۔",
    "detail": "جب حالات ہاتھ سے نکل جائیں... خاص طور پر جب کوئی اور سہارا نہ ہو۔"
  },
  {
    "title": "صحت کے لیے دعا",
    "dua": "اللَّهُمَّ رَبَّ النَّاسِ أَذْهِبِ الْبَأْسَ، اشْفِ أَنْتَ الشَّافِي، لَا شِفَاءَ إِلَّا شِفَاؤُكَ، شِفَاءً لَا يُغَادِرُ سَقَمًا",
    "translation": "اے لوگوں کے رب! تکلیف کو دور کر دے، تو ہی شفا دینے والا ہے، تیری شفا کے سوا کوئی شفا نہیں، ایسی شفا عطا فرما جو ہر مرض کو ختم کر دے۔",
    "detail": "جب بھی آپ یا کوئی قریبی شخص بیمار ہو... شفا دوا سے نہیں بلکہ اللہ کے حکم سے آتی ہے۔"
  },
  {
    "title": "غصے کے وقت کی دعا",
    "dua": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
    "translation": "میں اللہ کی پناہ مانگتا ہوں شیطان مردود سے۔",
    "detail": "غصہ انسان کی عقل پر پردہ ڈال دیتا ہے... غصے کی آگ پر پانی ڈالنے جیسا عمل ہے۔"
  },
  {
    "title": "نماز کے بعد کی دعا",
    "dua": "اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ",
    "translation": "اے اللہ! تو ہی سلامتی ہے، اور تیری طرف سے ہی سلامتی ہے، تو بڑی برکت والا ہے، اے جلال و عزت والے۔",
    "detail": "یہ دعا نبی ﷺ ہر فرض نماز کے بعد پڑھتے تھے... نماز کو مکمل اور پُراثر بناتی ہے۔"
  },
  {
    "title": "رزق کے لیے دعا",
    "dua": "اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
    "translation": "اے اللہ! مجھے اپنے حلال رزق کے ذریعے حرام سے بچا لے، اور اپنی عطا سے مجھے دوسروں کا محتاج نہ بنا۔",
    "detail": "یہ دعا ان لوگوں کے لیے ہے جو رزق میں برکت چاہتے ہیں... رزق کا اصل مالک صرف اللہ ہے۔"
  },
  {
    "title": "دل کے سکون کی دعا",
    "dua": "أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ",
    "translation": "خبردار! دلوں کا سکون صرف اللہ کے ذکر سے ہی ملتا ہے۔",
    "detail": "یہ قرآن کی سورۃ الرعد کی آیت ہے... یہ سب دل کی دوا ہے۔"
  }
]
