[
  {
    "Title": "سفر کی دعا",
    "Dua": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَىٰ رَبِّنَا لَمُنقَلِبُونَ",
    "Detail": "جب بھی ہم کسی سواری پر سوار ہوتے ہیں، چاہے وہ کار ہو، جہاز یا جانور، تو یہ دعا پڑھنی چاہیے۔ یہ قرآن کی سورۃ الزخرف (آیت 13-14) سے لی گئی ہے۔ اس میں ہم اللہ کا شکر ادا کرتے ہیں کہ اس نے ہمارے لیے سواریوں کو تابع بنایا، ورنہ ہم خود ان پر قابو پانے کی طاقت نہیں رکھتے تھے۔\n\nدعا کا اختتام ہمیں یاد دلاتا ہے کہ ہر سفر کا آخری پڑاؤ اللہ کے پاس لوٹنا ہے۔ نبی ﷺ جب بھی سفر پر روانہ ہوتے تو یہ دعا پڑھتے تھے۔ یہ دعا ہمیں شکر، عاجزی اور آخرت کی یاد دلاتی ہے۔"
  },
  {
    "Title": "توبہ کی دعا",
    "Dua": "رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ",
    "Detail": "یہ دعا ہر اس شخص کے لیے ہے جو اپنے گناہوں پر نادم ہو کر اللہ کی طرف رجوع کرتا ہے۔ اس کا مفہوم ہے: 'اے میرے رب! مجھے بخش دے اور میری توبہ قبول فرما، بے شک تو ہی بہت زیادہ توبہ قبول کرنے والا اور مہربان ہے۔'\n\nیہ دعا ہمیں نبی ﷺ نے سکھائی، اور آپ خود بھی دن میں 70 سے زائد مرتبہ استغفار فرمایا کرتے تھے۔ (صحیح بخاری: 6307)\n\nیہ ہمیں یاد دلاتی ہے کہ اللہ کی رحمت بےحد وسیع ہے، اور توبہ کا دروازہ ہر وقت کھلا ہے۔"
  },
  {
    "Title": "صبح بیدار ہونے کی دعا",
    "Dua": "الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
    "Detail": "صبح کے وقت جاگتے ہی یہ دعا ہمیں سکھاتی ہے کہ ہر نئی صبح، ایک نئی زندگی کی علامت ہے۔ نیند کو اسلام میں موت کی ایک چھوٹی شکل قرار دیا گیا ہے، اور جاگنا ایک طرح سے اللہ کی طرف سے زندگی کی تجدید ہے۔\n\nیہ دعا نبی ﷺ کی سنت ہے (صحیح بخاری: 6312)، اور اس میں ہم اللہ کا شکر ادا کرتے ہیں کہ اس نے ہمیں دوبارہ زندہ کیا، اور یاد دہانی کرواتا ہے کہ ہمیں آخرکار اسی کی طرف لوٹنا ہے۔\n\nیہ ایک شکر اور شعور کے ساتھ دن کا آغاز کرنے کی بہترین مثال ہے۔"
  },
  {
    "Title": "رات کو سوتے وقت کی دعا",
    "Dua": "اللَّهُمَّ بِاسْمِكَ أَمُوتُ وَأَحْيَا",
    "Detail": "جب انسان سونے کے لیے لیٹتا ہے تو یہ دعا پڑھ کر خود کو اللہ کے سپرد کر دیتا ہے۔ اس کا مطلب ہے: 'اے اللہ! میں تیرے نام پر ہی مرتا ہوں اور تیرے نام پر ہی زندہ ہوتا ہوں۔'\n\nنبی ﷺ ہر رات سونے سے پہلے یہ دعا پڑھتے تھے۔ (صحیح بخاری: 7393)\n\nیہ دعا ہمیں یہ سکھاتی ہے کہ ہماری جان، ہماری نیند، ہماری بیداری — سب کچھ اللہ کی اجازت سے ہے۔ سونا ایک طرح کا روحانی سپردگی کا عمل بن جاتا ہے جب ہم اس دعا کے ساتھ سوتے ہیں۔"
  },
  {
    "Title": "مشکل وقت میں پڑھی جانے والی دعا",
    "Dua": "حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
    "Detail": "جب حالات ہاتھ سے نکل جائیں، جب دنیا مایوس کرے، تب یہ مختصر مگر طاقتور دعا امید اور اعتماد کی ایک چمک بن کر دل میں اُبھرتی ہے۔\n\nاس کا مطلب ہے: 'اللہ ہمارے لیے کافی ہے، اور وہی بہترین کارساز ہے۔' یہ دعا قرآن کی سورۃ آل عمران (آیت 173) میں آئی ہے، جہاں صحابہؓ کو دشمن کی دھمکیوں کے باوجود اللہ پر یقین رکھنے کا کہا گیا تھا۔\n\nیہ دعا ہمیں سکھاتی ہے کہ سب کچھ اللہ کے ہاتھ میں ہے، اور ہمیں اسی پر بھروسہ رکھنا ہے، خاص طور پر جب کوئی اور سہارا نہ ہو۔"
  },
  {
    "Title": "صحت کے لیے دعا",
    "Dua": "اللَّهُمَّ رَبَّ النَّاسِ أَذْهِبِ الْبَأْسَ، اشْفِ أَنْتَ الشَّافِي، لَا شِفَاءَ إِلَّا شِفَاؤُكَ، شِفَاءً لَا يُغَادِرُ سَقَمًا",
    "Detail": "جب بھی آپ یا کوئی قریبی شخص بیمار ہو، یہ دعا نہ صرف زبان پر ہونی چاہیے بلکہ دل سے نکلنی چاہیے۔\n\nنبی کریم ﷺ بیماروں پر ہاتھ رکھ کر یہ دعا پڑھا کرتے تھے (صحیح بخاری: 5742)، جس کا مطلب ہے: 'اے لوگوں کے رب! تکلیف کو دور کر دے، تو ہی شفا دینے والا ہے، تیری شفا کے سوا کوئی شفا نہیں، ایسی شفا عطا فرما جو ہر مرض کو ختم کر دے۔'\n\nیہ دعا ہمیں یاد دلاتی ہے کہ شفا دوا سے نہیں بلکہ اللہ کے حکم سے آتی ہے۔"
  },
  {
    "Title": "غصے کے وقت کی دعا",
    "Dua": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
    "Detail": "غصہ انسان کی عقل پر پردہ ڈال دیتا ہے، اور وہ باتیں یا کام کر بیٹھتا ہے جن پر بعد میں افسوس ہوتا ہے۔ نبی ﷺ نے فرمایا: 'غصہ شیطان سے ہے، اور شیطان آگ سے پیدا ہوا، اس لیے جب تمہیں غصہ آئے تو اللہ کی پناہ مانگو۔' (سنن ابی داود: 4782)\n\nیہ دعا پڑھنے سے دل کو سکون ملتا ہے، اور شیطان کے وسوسے کم ہوتے ہیں۔ یہ دعا دراصل غصے کی آگ پر پانی ڈالنے جیسا عمل ہے۔"
  },
  {
    "Title": "نماز کے بعد کی دعا",
    "Dua": "اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ",
    "Detail": "یہ دعا نبی ﷺ ہر فرض نماز کے بعد پڑھتے تھے (صحیح مسلم: 591)۔ اس کا مطلب ہے: 'اے اللہ! تو ہی سلامتی ہے، اور تیری طرف سے ہی سلامتی ہے، تو بڑی برکت والا ہے، اے جلال و عزت والے۔'\n\nیہ ہمیں یاد دلاتی ہے کہ ہماری عبادت اسی کے لیے ہے، اور ہر سلامتی — چاہے وہ جسم کی ہو، دل کی ہو یا زندگی کی — اللہ ہی کے ہاتھ میں ہے۔\n\nیہ دعا دل کو ایک روحانی سکون عطا کرتی ہے، نماز کو مکمل اور پُراثر بناتی ہے۔"
  },
  {
    "Title": "رزق کے لیے دعا",
    "Dua": "اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
    "Detail": "یہ دعا ان لوگوں کے لیے ہے جو رزق میں برکت چاہتے ہیں، اور چاہتے ہیں کہ حرام سے بچ کر صرف پاکیزہ روزی حاصل کریں۔ نبی ﷺ نے یہ دعا سکھائی:\n\n'اے اللہ! مجھے اپنے حلال رزق کے ذریعے حرام سے بچا لے، اور اپنی عطا سے مجھے دوسروں کا محتاج نہ بنا۔' (ترمذی: 3563)\n\nیہ دعا ہمیں معاشی پریشانی میں صبر، تقویٰ اور اعتماد سکھاتی ہے کہ رزق کا اصل مالک صرف اللہ ہے۔"
  },
  {
    "Title": "دل کے سکون کی دعا",
    "Dua": "أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ",
    "Detail": "یہ قرآن کی سورۃ الرعد (آیت 28) کی آیت ہے، جس میں اللہ تعالیٰ فرماتا ہے: 'خبردار! دلوں کا سکون صرف اللہ کے ذکر سے ہی ملتا ہے۔'\n\nدنیا کی دوڑ میں ہم اکثر اندرونی بےچینی محسوس کرتے ہیں، اور کچھ سمجھ نہیں آتا۔ اس آیت میں اللہ نے ہمیں راستہ دکھایا ہے — دل کو سکون چاہیے؟ اللہ کا ذکر کرو۔ چاہے وہ تسبیح ہو، دعا ہو، نماز ہو — یہ سب دل کی دوا ہے۔"
  }
]
