[
  {
    "title": "صدقہ پر حدیث",
    "dua": "الصدقةُ تُطفئُ غضبَ الربِّ",
    "translation": "صدقہ اللہ کے غضب کو بجھا دیتا ہے۔",
    "detail": "یہ حدیث ہمیں بتاتی ہے کہ جب کوئی انسان گناہ کر بیٹھے یا اللہ کی ناراضگی کا خوف ہو، تو صدقہ ایک مؤثر ذریعہ ہے اللہ کی رضا کو پانے کا۔ صدقہ نہ صرف محتاجوں کی مدد کرتا ہے، بلکہ یہ دل کو نرم اور اللہ کے قریب کرتا ہے۔"
  },
  {
    "title": "نماز پر حدیث",
    "dua": "الصلاةُ عِمادُ الدِّينِ، فمَن أقامَها فقد أقامَ الدِّينَ",
    "translation": "نماز دین کا ستون ہے، جس نے اسے قائم کیا اُس نے دین کو قائم کیا۔",
    "detail": "یہ حدیث ہمیں یہ سکھاتی ہے کہ نماز صرف ایک عبادت نہیں بلکہ پورے دین کی بنیاد ہے۔ اگر نماز مضبوط ہے تو دین بھی مضبوط ہے، اور اگر نماز کمزور ہے تو دین بھی کمزور ہو جاتا ہے۔"
  },
  {
    "title": "اخلاق پر حدیث",
    "dua": "إنَّ مِنْ خِيَارِكُمْ أَحْسَنُكُمْ أَخْلَاقًا",
    "translation": "تم میں سب سے بہتر وہ ہے جس کا اخلاق سب سے بہتر ہو۔",
    "detail": "اسلام میں اخلاق کو ایمان کا حصہ قرار دیا گیا ہے۔ یہ حدیث ہمیں یاد دلاتی ہے کہ نماز، روزہ، حج سب اپنی جگہ — لیکن اگر زبان، مزاج اور برتاؤ اچھا نہیں تو دین کا حسن بھی ادھورا ہے۔"
  },
  {
    "title": "مسکراہٹ پر حدیث",
    "dua": "تَبَسُّمُكَ فِي وَجْهِ أَخِيكَ لَكَ صَدَقَةٌ",
    "translation": "تمہارا اپنے بھائی کے چہرے پر مسکرانا بھی صدقہ ہے۔",
    "detail": "یہ حدیث چھوٹے عمل کی بڑی فضیلت بیان کرتی ہے۔ ایک سادہ مسکراہٹ جو دل سے ہو، رشتہ مضبوط کرتی ہے، دل صاف کرتی ہے اور اللہ کے ہاں نیکی لکھی جاتی ہے۔"
  },
  {
    "title": "سب سے بہترین عمل پر حدیث",
    "dua": "أَفْضَلُ الْأَعْمَالِ أَدْوَمُهَا وَإِنْ قَلَّ",
    "translation": "اللہ کے نزدیک سب سے بہترین عمل وہ ہے جو مسلسل کیا جائے، اگرچہ تھوڑا ہو۔",
    "detail": "اس حدیث سے ہمیں سکھایا جاتا ہے کہ اسلام میں مستقل مزاجی کو بہت اہمیت حاصل ہے۔ روز تھوڑا سا ذکر، نماز کی پابندی، چھوٹے چھوٹے نیک کام — یہ سب اللہ کے ہاں بہت محبوب ہیں۔"
  },
  {
    "title": "دین آسان ہے",
    "dua": "إِنَّ الدِّينَ يُسْرٌ",
    "translation": "یقیناً دین آسان ہے۔",
    "detail": "اسلام کوئی بوجھ نہیں، بلکہ آسانی اور سہولت کا دین ہے۔ اللہ نے جو احکام دیے ہیں، وہ ہماری فطرت کے مطابق ہیں۔ اس حدیث کا پیغام ہے کہ اسلام کو سہولت کے ساتھ اپنائیں، اپنے اوپر سختی نہ کریں۔"
  },
  {
    "title": "بڑوں کی عزت پر حدیث",
    "dua": "لَيْسَ مِنَّا مَنْ لَمْ يُوَقِّرْ كَبِيرَنَا",
    "translation": "وہ ہم میں سے نہیں جو ہمارے بڑوں کی عزت نہ کرے۔",
    "detail": "یہ حدیث معاشرتی ادب کا درس دیتی ہے۔ اسلام صرف عبادات کا مجموعہ نہیں، بلکہ ایک مکمل اخلاقی نظام بھی ہے، جس میں بڑوں کی عزت، چھوٹوں پر شفقت شامل ہے۔"
  },
  {
    "title": "روزہ پر حدیث",
    "dua": "الصِّيَامُ جُنَّةٌ",
    "translation": "روزہ ڈھال ہے۔",
    "detail": "روزہ صرف بھوکے رہنے کا نام نہیں، بلکہ یہ انسان کو گناہوں سے بچاتا ہے، نفس کو قابو میں رکھتا ہے اور اللہ کے قریب کرتا ہے۔ یہ حدیث ہمیں روزے کی روحانی طاقت کا احساس دلاتی ہے۔"
  },
  {
    "title": "ماں کی عظمت پر حدیث",
    "dua": "أُمُّكَ، ثُمَّ أُمُّكَ، ثُمَّ أُمُّكَ، ثُمَّ أَبُوكَ",
    "translation": "تیری ماں، پھر تیری ماں، پھر تیری ماں، پھر تیرا باپ۔",
    "detail": "یہ حدیث ہمیں ماں کی بے مثال عظمت یاد دلاتی ہے۔ ماں کی خدمت اور دعائیں ہی انسان کی کامیابی کی بنیاد بن سکتی ہیں۔"
  },
  {
    "title": "بھائی چارے پر حدیث",
    "dua": "الْمُسْلِمُ أَخُو الْمُسْلِمِ",
    "translation": "مسلمان، مسلمان کا بھائی ہے۔",
    "detail": "یہ حدیث اسلامی معاشرے کی بنیاد ہے — جس میں ہر فرد دوسرے کا خیر خواہ ہو۔ حسد، غیبت، دشمنی چھوڑ کر، ہمیں اپنے مسلمان بھائیوں سے محبت، مدد اور ہمدردی کرنی چاہیے۔"
  }
]
