{
  "type": "Hadith",
  "items": [
  {
    "title": "صدقہ پر حدیث",
    "dua": "الصدقةُ تُطفئُ غضبَ الربِّ",
    "translation": "صدقہ اللہ کے غضب کو بجھا دیتا ہے۔",
    "detail": "یہ حدیث ہمیں بتاتی ہے کہ جب کوئی انسان گناہ کر بیٹھے یا اللہ کی ناراضگی کا خوف ہو، تو صدقہ ایک مؤثر ذریعہ ہے اللہ کی رضا کو پانے کا۔ (سنن ترمذی: 2616)۔ صدقہ نہ صرف محتاجوں کی مدد کرتا ہے، بلکہ یہ دل کو نرم اور اللہ کے قریب کرتا ہے۔"
  },
  {
    "title": "نماز پر حدیث",
    "dua": "الصلاةُ عِمادُ الدِّينِ، فمَن أقامَها فقد أقامَ الدِّينَ",
    "translation": "نماز دین کا ستون ہے، جس نے اسے قائم کیا اُس نے دین کو قائم کیا۔",
    "detail": "یہ حدیث نماز کی اہمیت کو بیان کرتی ہے۔ (سنن بیہقی: 4897، ضعیف سند کے ساتھ)۔ نماز صرف ایک عبادت نہیں بلکہ پورے دین کی بنیاد ہے۔"
  },
  {
    "title": "اخلاق پر حدیث",
    "dua": "إنَّ مِنْ خِيَارِكُمْ أَحْسَنُكُمْ أَخْلَاقًا",
    "translation": "تم میں سب سے بہتر وہ ہے جس کا اخلاق سب سے بہتر ہو۔",
    "detail": "اسلام میں اخلاق کو ایمان کا حصہ قرار دیا گیا ہے۔ (صحیح بخاری: 3559، صحیح مسلم: 2321)۔ یہ حدیث ہمیں یاد دلاتی ہے کہ نماز، روزہ، حج سب اپنی جگہ — لیکن اچھا اخلاق دین کا حسن ہے۔"
  },
  {
    "title": "مسکراہٹ پر حدیث",
    "dua": "تَبَسُّمُكَ فِي وَجْهِ أَخِيكَ لَكَ صَدَقَةٌ",
    "translation": "تمہارا اپنے بھائی کے چہرے پر مسکرانا بھی صدقہ ہے۔",
    "detail": "یہ حدیث چھوٹے عمل کی بڑی فضیلت بیان کرتی ہے۔ (سنن ترمذی: 1956، حسن)۔ ایک سادہ مسکراہٹ بھی نیکی شمار ہوتی ہے۔"
  },
  {
    "title": "سب سے بہترین عمل پر حدیث",
    "dua": "أَفْضَلُ الْأَعْمَالِ أَدْوَمُهَا وَإِنْ قَلَّ",
    "translation": "اللہ کے نزدیک سب سے بہترین عمل وہ ہے جو مسلسل کیا جائے، اگرچہ تھوڑا ہو۔",
    "detail": "یہ حدیث نبی کریم ﷺ سے صحیح سند کے ساتھ مروی ہے۔ (صحیح بخاری: 6465، صحیح مسلم: 782)۔ اسلام میں مستقل مزاجی کو بہت اہمیت حاصل ہے۔"
  },
  {
    "title": "دین آسان ہے",
    "dua": "إِنَّ الدِّينَ يُسْرٌ",
    "translation": "یقیناً دین آسان ہے۔",
    "detail": "نبی کریم ﷺ نے فرمایا: 'بے شک دین آسان ہے'۔ (صحیح بخاری: 39)۔ اسلام کوئی بوجھ نہیں، بلکہ آسانی اور سہولت کا دین ہے۔"
  },
  {
    "title": "بڑوں کی عزت پر حدیث",
    "dua": "لَيْسَ مِنَّا مَنْ لَمْ يُوَقِّرْ كَبِيرَنَا",
    "translation": "وہ ہم میں سے نہیں جو ہمارے بڑوں کی عزت نہ کرے۔",
    "detail": "یہ حدیث نبی ﷺ سے صحیح سند سے مروی ہے۔ (سنن ترمذی: 1920، صحیح)۔ یہ معاشرتی ادب اور اسلامی معاشرت کے اصولوں کی یاد دہانی ہے۔"
  },
  {
    "title": "روزہ پر حدیث",
    "dua": "الصِّيَامُ جُنَّةٌ",
    "translation": "روزہ ڈھال ہے۔",
    "detail": "یہ حدیث رمضان اور عام دنوں کے روزوں کی اہمیت بیان کرتی ہے۔ (صحیح بخاری: 1894، صحیح مسلم: 1151)۔ روزہ انسان کو گناہوں سے بچاتا ہے اور تقویٰ پیدا کرتا ہے۔"
  },
  {
    "title": "ماں کی عظمت پر حدیث",
    "dua": "أُمُّكَ، ثُمَّ أُمُّكَ، ثُمَّ أُمُّكَ، ثُمَّ أَبُوكَ",
    "translation": "تیری ماں، پھر تیری ماں، پھر تیری ماں، پھر تیرا باپ۔",
    "detail": "یہ حدیث نبی ﷺ کے اس جواب پر مبنی ہے جب کسی نے پوچھا کہ حسن سلوک کا سب سے زیادہ حق دار کون ہے؟ (صحیح بخاری: 5971، صحیح مسلم: 2548)۔ یہ ماں کی عظمت اور احترام پر زور دیتی ہے۔"
  },
  {
    "title": "بھائی چارے پر حدیث",
    "dua": "الْمُسْلِمُ أَخُو الْمُسْلِمِ",
    "translation": "مسلمان، مسلمان کا بھائی ہے۔",
    "detail": "یہ حدیث اسلامی معاشرتی نظام کی بنیاد ہے۔ (صحیح بخاری: 2442، صحیح مسلم: 2580)۔ حسد، غیبت اور دشمنی سے بچنے اور محبت و ہمدردی کو فروغ دینے کا پیغام دیتی ہے۔"
  }
]
}
