[
  {
    "index": "1",
    "name": "نماز کی اہمیت",
    "body": "نماز اسلام کا سب سے اہم و اکرم فریضہ ہے۔نماز دین کا ستون ہونے کے ساتھ دل کا نور بھی ہے۔ اس لیے نماز کو *اَلصَّلَاۃُ عِمَادُالِّدیْنٌ* سے تعبیر کیا گیا ہے۔ جس طرح سے عمارت کو قائم رکھنے کیلئے ستون کا ہونا ضروری ہے ٹھیک اسی طرح دین پر قائم رہنے کے لیے نماز کا ہونا اشد ضروری ہے جس کی اہمیت قرآن کی آیت *وَاَقِيْمُوْا الصَّلَاةَ وَاٰتُوْا الَّزكَاةٌ* سے ثابت ہوتی ہے۔ یہی نہیں بلکہ اسلام کے ارکان کا حکم زمین پر رہتے ہی دیا گیا لیکن نماز کے لئے خدائے وحدہ لاشریک نے اہتمام فرمایا کہ رسولِ کریمﷺ کو معراج کی سیر کرا کر عالم بالا میں عطا فرمائی۔\n\nنیز اسلام کے ارکان میں سب سے پہلے نماز فرض ہوئی کیوں کہ نماز جنت کی کنجی ہے۔نماز کے بارے میں حضرت ابوھریرہ رضی اللہ تعالی عنہ سے روایت ہے کہ رسول دو عالمﷺ نے ارشاد فرمایا: “قیامت کے دن بندے کے اعمال کا جو حساب ہوگا ان میں سب سے اوّل نمبر پر نماز ہے۔” سو اگر نماز درست نکلی تو بندہ کامیاب اور بامراد، اگر نماز خراب نکلی تو ناکام ہوگا اور نقصان اٹھائے گا۔\n\nنماز کی ادائیگی مسلمانوں میں نظم و ضبط پیدا کرتی ہے اس لیے ہر بالغ مرد عورت پر لازم ہے کہ وہ نماز کی پابندی کرے کیونکہ نمازی دنیا و آخرت میں سرخرو ہوں گے لیکن ایک وقت کی نماز نہ ادا کرنے پر حضور صلی اللہ علیہ وسلم نے فرمایا کہ جسکی عصر کی (ایک) نماز جاتی رہی( اس کا اس قدر نقصان ہوا کہ) جیسے اس کے اہل و اولاد اور سارا مال ختم ہو گیا ہو۔ اسی پر بس نہیں بلکہ امام ابن القیم رحمۃ اللہ علیہ فرماتے ہیں کہ بندے کو اللہ کے سامنے دو مرتبہ کھڑا ہونا ہے۔ لہذا جو شخص نماز کی حالت میں اللہ کے سامنے کھڑا ہونے کا حق ادا کر دیتا ہے اسکے لیے قیامت کے دن کا کھڑا ہونا آسان ہوگا اور جو شخص نماز والے قیام کا حق ادا نہیں کرتا اسکے لیے قیامت کے دن والا قیام انتہائی سخت ہوگا۔\n\nنماز کے فوائد\n\nنماز سے انسان کو روحانی سکون کے ساتھ ساتھ جسمانی فوائد بھی حاصل ہوتے ہیں اسی کی بنا پر انسان پاک و صاف رہنے کے ساتھ ساتھ کئی بیماریوں سے محفوظ بھی رہتا ہے۔ نماز انسان کو بےحیائی،برائی، نشے کی عادت نیز تمام برائیوں سے روکتی ہے جس کو قرآن نے کچھ اسطرح بیان کیا ہے *اِنَّ اَلصَّلَاۃَ تَنْهٰى عَنِ الْفَحْشَاءِ وَالْمُنْكَرْ* ترجمہ: “بے شک نماز بے حیائی اور بری باتوں سے روکتی ہے”\n\nضرورت اس بات کی ہےکہ ہم نماز کو خلوصِ دل سے ادا کریں کیونکہ یہ نزولِ رحمت کے ساتھ جہنم سے نجات کا پروانہ بھی ہے۔ یہ مومن اور کافر میں فرق کو واضح کرتی ہے۔ جس کے بارے میں آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا کہ نماز مومن اور کافر کے درمیان حد فاصل ہے۔ لہٰذا جو بھی نماز کو دھیان اور توجہ سے پڑھیں گے ان کو خدا کی جانب سے رحمت اور عنایت حاصل ہوگی جو قرآن کی آیت *اُولِٰئِكَ عَلَيْهِمْ صَلَوٰةٌ مِّنْ رَّبِّهِمْ وَرَحْمَةٌ وَ اُولٰئِكَ هُمُ الْمُهْتَدُوْنَ* سے ثابت ہے۔\n\nنماز کا اجروثواب\n\nعزیز ساتھیو! ذرا سوچئیے کہ وہ حقیقی مالک جو ہمارے گناہوں کے باوجود ہمیں اپنی نعمتوں سے محروم نہیں کرتا تو نماز کا ثواب کتنا ہوگا ہے، یہ اندازہ کرنا مشکل ہی نہیں بلکہ ناممکن ہے۔ اس لیے نماز قائم کرنے والوں کو قرآن میں جابجا بشارت سنائی گئی ہے۔ ارشاد ربانی ہے*اِنَّ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصَّالِحٰتِ وَاَقَامُوا الصَّلَاۃَ وَاٰتُوا الَّزكٰوةَ لَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُوْنَ*ترجمہ۔ “وہ لوگ جو ایمان لائے نیک عمل کیے، نماز قائم کیے اور زکوٰۃ ادا کیے وہ اپنے رب کے پاس اپنے اجر کے مستحق ہوں گے، نہ انہیں کوئی خوف لاحق ہوگا نہ انہیں کوئی غم پہنچے گا”۔دوستو! اس آیت میں بھی یہ واضح نہیں کیا گیا کہ کتنا اجر ہوگا۔ حضرت جبرئیل علیہ السلام فرماتے ہیں چھ مہینے بارش ہوتی رہے میں بارش کے ہر قطرے کو گن سکتا ہوں مگر جب نمازی اللہ کے سامنے کھڑا ہوتا ہے تو اسکی نیکیاں نہیں گن سکتا کیونکہ جب نمازی رکوع میں جاتا ہے تو پورے جسم کے برابر سونا خرچ کرنے کے برابر اجر پاتا ہے۔\n\nاسی طرح جب نمازی ایک دفعہ اَللّٰہُ اَکْبَرْ کہتا ہے تو ایک اونٹ ذبح کرکے اسکو غرباء و مساکین میں تقسیم کرنے کے برابر اجر ہے۔ ذراغورکیجئے کہ جب اللہ اکبر کہنے پر اتنا ثواب ملتا ہے مکمل نماز پڑھنے کا ثواب کتنا ملے گا؟ اسکا شمار کرنا ممکن ہی نہیں بلکہ مشکل بھی ہے اور جب نمازی سجدے میں جاتا ہے تو انتہا ہو جاتی ہے کیونکہ انسان کو اللہ نے غیرت اور عزتِ نفس بھی دی ہے۔ اس لئے انسان ناک، ماتھے اور پیشانی کیلیے عجیب فیصلے کرلیتا ہے لیکن اللہ کا نظام تو دیکھیے کہ جب بندہ سجدے میں جاتا ہے تو یہ تمام چیزیں مٹی میں ملا دیتا ہے اور بندہ اللہ کے سامنے ناک اور پیشانی رگڑ رہا ہوتا ہے اس وقت میرا اللہ کہتا ہے کہ اس کو عزت و وقار کا شعور دیا اس نے اپنی عزت اور شان و شوکت سب کچھ میرے سامنے نچھاور کر دی۔ تو اس وقت سجدے میں خود رب مل جاتا ہے اس لیے ہم اس کے اجروثواب کو شمار نہیں کرسکتے کیونکہ جب وہ خالق و مالک اپنے بندوں کو بلاوجہ اتنا سب کچھ عطا کر دیتا ہے تو میرا اندازہ ہے کہ وہ نماز کے ادا کرنے پر بے شمار اجروثواب عطا کرے گا۔ انشاءاللہ۔\n\nآخر میں اللہ سے دعا ہے کہ اللہ ہم تمام کو نماز کی اہمیت ،فوائد اور اجروثواب کو سمجھ کر اس پر مستقل عمل پیرا ہونے کی توفیق عطا فرمائے آمین۔"
  },
  {
  "index": "2",
  "name": "پانچ نمازوں کی فضیلت",
  "body": "دوستو نماز سب عبادتوں سے بڑی عبادت ہے اور اس کی وجہ یہ ہے کہ اس میں انسان اپنے رب کریم کے حضور میں اپنی ذات کو بالکل ذلیل و خوار کرکے پیش کر دیتا ہے اس لئے میں نماز کے اجر ثواب اور فضیلت کو کماحقہٗ تحریر کرنے سے قاصر ہوں۔\n\nدوستو! غور کیجئے کہ فجر کا وقت کتنی عظمت اور بابرکت والا ہےکہ خود اللہ تبارک و تعالی اہل دانش کو خطاب کرتے ہوئے فجر کی قسم کھا کر فرماتا ہے “وَالْفَجْرِ • وَلَيَالٍ عَشْرٍ • وَّالشَّفْعِ وَالْوَتْرِ • وَالَّيْلِ اِذَا يَسْرِ • هَلْ فِيْ ذٰلِكَ قَسَمٌ الِّذِيْ حِجْرٍ•”\nترجمه۔قسم ہے فجر اور دس راتوں کی اور جنت اور طاق اور رات کی جب وہ چلنے لگے یقیناً اس میں عقلمندوں کے لئے بڑی قسم ہے۔\n\nعزیز ساتھیو! تمام لوگ سمجھ کے لحاظ سے ایک جیسے نہیں ہوتے اور پھر جس چیز کی اللہ نے قسم کھائی ہے بھلا وہ اس کی عظمت کا اندازہ کس طرح کر سکتے ہیں جس میں عقلمندوں کو خاص کیا گیا ہے۔\n\nابن کثیر فرماتے ہیں کہ’ اَلَّذِیْ حِجْرٍ’ سے عقلمند اور دیندار لوگ مراد ہیں۔ اس لیے عقل کا نام حجر رکھا گیا کیونکہ وہ انسان کو ہر اس قول وفعل سے روکتی ہے جو اس کے مناسب نہ ہو۔\n\nفجر کی نماز مسلمان کو تحفظ فراہم کرتی ہے بلکہ یہ دنیا کی کامیابی کے ساتھ جہنم سے نجات کا پروانہ بھی ہے اس کے بارے میں فرمان رسول ﷺ ہے۔\n*لن يلج النار احد صلى قبل طلوع وقبل غروبها*\nترجمه۔”طلوع فجر اور غروب شمس سے قبل ادا کرنے والا جہنم میں ہرگز داخل نہیں ہوگا” (مسلم)\nاس سے معلوم ہوا فجر اور عصر کی نماز کی ادائیگی جہنم کی آگ سے نجات کا پروانہ ہے۔ یہ ہمارے نبی ﷺ کا فرمان ہے اور ہمارے نبی کے فرمان سے بڑھ کر سچا اور راحت بخش فرمان کسی کا ہو ہی نہیں سکتا۔\nاسی طرح دوسری جگہ فجر اور عشاء کی فضیلت کا ذکر کرتے ہیں حضور نے ارشاد فرمایا *من صلی البردین دخل الجنة*\n\nاس میں فجر کی نماز کو خاص طور پر اس لئے ذکر کیا گیا ہے کہ اس وقت انسان پر نیند کا غلبہ رہتا ہے اور ہوا کے خوشگوار جھونکے اسے تھپکیاں دےکر نیند کی وادیوں میں لے جاتے ہیں ادھر شیطان اپنے حربے آزماتا ہے لیکن اس کے باوجود بندۂ خدا اپنی نیند اور آرام کو چھوڑ کر بستر سے نماز کیلئے کھڑا ہو جاتا ہے۔ اسطرح شیطان کی تمام محنت اور جدوجہد برباد ہو جاتی ہے۔\n\nدوسرا وقت عشاء کا ہے جس میں انسان دن بھر کی تھکن سے چور کھانا کھاتے ہی بستر پر دراز ہونا چاہتا ہے لیکن بندہ نفسانی خواہشات اور شیطان کے حربوں کے باوجود بارگاہ ایزدی میں نماز کے لئے حاضر ہو کر شیطان کے سبھی ارادوں کو چکنا چور کر کے مٹی میں ملا دیتا ہے۔ اس لیے آپ صلی اللہ علیہ وسلم کا ان دو اوقات کے عبادت گزار بندوں کو جنت کی بشارت دینا اس خدمت پر ہے کہ جو شخص فجر اور عشاء کی نمازوں کی ادائیگی کو اپنا معمول بنا لیتا ہے اس کے لیے باقی نمازوں کو ادا کرنا گراں نہیں ہوتا۔\nاسی طرح عصر کی محافظت کی قرآن میں خوب تلقین کی گئی ہے ارشاد ربانی ہے۔\n*حٰفِظُوْ عَلَى الصَّلَوٰاتِ وَالصَّلٰوةِ الْوُسْطٰي*\nترجمه۔”سب نمازوں کی حفاظت کیا کرو لیکن بالخصوص درمیانی نماز کی”\nاس کے علاوہ نماز ظہر کا الگ اجر و ثواب اور مرتبہ ہے۔ امیر المومنین حضرت عمر فاروق رضی اللہ تعالی عنہ سے مروی ہے کہ حضور اقدس صلی اللہ علیہ وسلم فرماتے ہیں کہ جس نے ظہر کی چار رکعتیں پڑھیں گویا اس نے تہجد کی چار رکعتیں پڑھی۔\n\nدوستو! میں پہلے کہہ چکا ہوں کہ نماز کی فضیلت اور ثواب کو کماحقہٗ ادا کرنے سے قاصر ہوں لیکن پھر بھی آپ تمام کی خدمت میں چند احادیث پیش کرتا ہوں جس سے نمازوں کی کچھ فضیلت اور اجر ثواب کا علم ہوجائے گا۔\n\nحضرت سلمان روایت کرتے ہیں کہ رسول صلی اللہ علیہ وسلم نے ارشاد فرمایا جب مسلمان اچھی طرح وضو کرتا ہے پھر پانچوں نمازیں پڑھتا ہے تو اس کے گناہ ایسے جھڑ جاتے ہیں جیسے کسی سوکھے پیڑ کے پتے جھڑتے ہیں۔ پھر آپ نے قرآن کی آیت \n*وَاَقِمِ الصَّلٰوةَ طَرَ فَيِ النَّهَارِ وَزُلَفًا مِّنَ الَّيْلِ • اِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ• ذٰلِكَ ذِكْرٰى لِذَّاكِرِيْنَ* \nتلاوت فرمائی۔\nترجمه۔”اے محمدﷺ آپ دن کے دونوں کناروں اور رات کے کچھ حصوں میں نماز کی پابندی کیا کیجئے بے شک نیکیاں برائیوں کو مٹا دیتی ہیں یہ باتیں مکمل نصیحت ہیں ان لوگوں کے لئے جو نصیحت قبول کرنے والے ہیں”\n\nاس میں بعض علماء کے نزدیک دونوں کناروں سے مراد دو حصے ہیں پہلے حصے میں صبح کی نماز دوسرے میں ظہر اور عصر کی نماز مراد ہے رات کے کچھ حصوں میں نماز پڑھنے سے مغرب اور عشاء کی نماز پڑھنا مراد ہے۔ اس میں مغرب کی نماز بمنزلہ ہے عشاء کی نماز (شجر کی) جڑ کی مانند ہے جو تاریکی اور اندھیرے میں نشوونما پاتی ہے۔ صبح کی نماز زندگی کی کونپل کی مانند ہے جو زمین سے سر نکالتا ہے۔ ظہر کی نماز شاخوں کی طرح اور عصر کی نماز شجر عبادت کے ثمر کی مانند ہے۔\n\nاسی طرح ایک دوسری حدیث میں پانچوں نمازوں کی فضیلت اور ثواب کے بارے میں آپ صلی اللہ علیہ وسلم نے فرمایا تم گناہ کرتے رہتے ہو اور جب صبح کی نماز پڑھتے ہو تو وہ انہیں دھو دیتی ہے۔ پھر گناہ کرتے رہتے ہو اور جب نماز ظہر پڑھتے ہو تو وہ انہیں دھو دیتی ہے۔ پھر گناہ کرتے رہتے ہو اور جب نماز عصر پڑھتے ہو تو وہ انہیں دھو دیتی ہے۔ پھر گناہ کرتے ہو جب نماز مغرب پڑھتے ہو تو وہ انہیں دھو دیتی ہے۔ پھر گناہ کرتے ہو جب نماز عشاء پڑھتے ہو تو وہ انہیں دھو دیتی ہے پھر تم سو جاتے ہو اور بیدار ہونے تک تمہارا کوئی گناہ نہیں لکھا جاتا۔\n\nدوستو! آپ ہی بتائیے یہ تمام تر اللہ کی رحمت نہیں تو اور کیا ہے اور جب اس کی رحمت انسان کو ڈھانپ لیتی ہے تو رنج و غم راحت میں بدل جاتے ہیں کیونکہ جب اللہ کا لطف ہوتا ہے تو وہ آگ کو بھی ٹھنڈی اور سلامتی والی بنا دیتا ہے اس کی حکمت کا غلبہ سب پر غالب ہے اور جب وہ فیصلہ کرتا ہے تو دشمن کو دوست بنا دیتا ہے اور خون خوار شیر کو بھی مہربان کر دیتا ہے۔ اسلئے ضرورت اس بات کی ہےکہ ہم تمام نمازوں کی پابندی کریں کیوں کہ ہماری دونوں جہاں کی کامیابی کا دارومدار نماز پر ہی ہے۔ اس لیے آخر میں اللہ سے دعا گو ہوں کہ اللہ پاک ہم تمام کو نمازوں کی حفاظت اور پابندی کرنے والا بنائے۔ آمین۔"
},
{
  "index": "3",
  "name": "باجماعت نماز پڑھنے کی فضیلت",
  "body": "دوستو! الحمدللہ ہم تمام اس بات سے بخوبی واقف ہیں کہ نماز پڑھنے کا بے شمار اجر ہے۔ اسی طرح جماعت سے نماز پڑھنے کا بھی الگ ثواب ہے لیکن اگر کوئی شخص عذر کی بنا پر جماعت سے نماز نہ پڑھے تو نماز پڑھنے کا ثواب تو حاصل ہوگا لیکن نماز باجماعت کے ثواب سے محروم رہ جائے گا۔\n\nنماز باجماعت کی فضیلت اور ثواب احادیث سے ثابت ہیں حتی کہ اگر دو آدمی بھی ہو تو جماعت قائم کی جائے۔ ان میں سے ایک امام بنے اور دوسرا مقتدی، جیسا کہ حضرت ابو موسی اشعری رضی اللہ تعالی عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا : “اثنان فما فوقها جماعة”( ابن ماجہ) دو یا دو کے اوپر جماعت ہے۔ کیونکہ خود رسول اللہ صلی اللہ علیہ وسلم نے کبھی اس کو ترک نہیں کیا۔ حتی کہ حالت مرض میں جب آپ کو خود چلنے کی طاقت نہ تھی دو آدمیوں کے سہارے سے مسجد میں تشریف لے گئے اور جماعت سے نماز پڑھی۔\n\nبلاشبہ شریعت محمدیہ میں جماعت کا بڑا اہتمام کیا گیا ہے اور ہونا بھی چاہیے تھا کیونکہ نماز جیسی شان بھی اس کو چاہتی تھی جس سے اس کی تکمیل ہو وہ بھی اعلی درجے پر پہنچا دی جائے۔ اس مقام پر پہلے اس آیت کو لکھ کر جس سے بعض مفسرین اور فقہاء نے جماعت کو ثابت کیا ہے، قولہ تعالی :” وَارْکَعُوْ مَعَ الَّراكِعِيْنَ” نماز پڑھو نماز پڑھنے والوں کے ساتھ ملکر ، یعنی اس آیت میں حکم صریح جماعت سے نماز پڑھنے کا ہےمگر چونکہ رکوع کے معنی مفسرین نے خضوع کے بھی لکھے اس لیے فرضیت ثابت نہ ہوگی بلکہ جماعت سے نماز پڑھنا واجب ہے۔\n\nعزیز ساتھیو! جماعت سے نماز پڑھنے کا ثواب تنہا نماز پڑھنے سے زیادہ ہے۔ اس سلسلے میں حضرت عبداللہ بن عمر رضی اللہ تعالی عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا باجماعت نماز ادا کرنا تنہا نماز ادا کرنے سے 27 درجے فضیلت رکھتا ہے۔\n\nاس سے یہ واضح ہے کہ جب آدمی نماز ثواب کے لئے پڑھتا ہے تو اسے چاہیے کہ وہ گھر میں نہ پڑے بلکہ مسجد میں جماعت کے ساتھ نماز ادا کرے۔ آپ ہی بتائیے کوئی ایسا شخص ہوگا جس کو ایک روپے کے 27 یا 28 روپے ملتے ہوں اور وہ ان کو چھوڑ دے؟ ہرگز نہیں، لیکن جب بات دین کی آتی ہے تو اس کے بڑے نفع سے بھی بے توجہی کی جاتی ہے اسکا سبب کیا ہو سکتا ہے یہی کہ ہم لوگوں کو دین کی پرواہ نہیں۔\n\nکیونکہ دین کا نفع ہم لوگوں کی نگاہ میں نفع ہی نہیں ہے لیکن اس کے برخلاف دنیا کی تجارت جس میں آنہ دو آنہ فی روپیہ نفع ملتا ہے اس کے پیچھے ہم دن بھر خاک چھانتے ہیں لیکن آخرت کی تجارت جس میں ستائیس گناہ نفع ہے اس کو ہم اپنے لئے مصیبت سمجھتے ہیں۔ یہی نہیں بلکہ آج ہمارا مسلم طبقہ بھی جماعت کو بوجھ اور اپنے کام میں رکاوٹ کا سبب سمجھتا ہے لیکن میں آپ لوگوں کو بتاتی چلوں کہ جن لوگوں کے نزدیک اللہ جل شانہٗ کی عظمت ہے وہ اللہ کے وعدوں پر یقین رکھتے ہیں کہ اسکے اجروثواب کی کوئی قیمت ہے ان کے یہاں یہ لچر عذر کوئی اہمیت نہیں رکھتے۔ ایسے ہی لوگوں کی اللہ جل شانہٗ نے کلام پاک میں تعریف فرمائی ہے۔ “رِجَالٌ لَّا تُلْهِيْهِمْ تِجَارَةٌ وَّلَا بَيْعٌ عَنْ ذِكْرِ اللهِ وَاِقَامِ الصَّلَاۃَ وَاِيْتَاءِ الَّزكٰوةَ*ترجمه۔ان میں ایسے لوگ جن کی اللہ کے ذکر نماز پڑھنے اور زکوٰۃ دینے سے تجارت اور خریدوفروخت انہیں غافل نہیں کرتی۔\n\nدوستو!۔اس لیے ضرورت اس بات کی ہےکہ ہم لوگوں کو خود غور کرلینا چاہیے کہ نماز باجماعت میں کس قدر اجر ثواب اور کس کس طرح حسنات میں اضافہ ہوتا چلا جاتا ہے کیوں کہ جو شخص گھر سے وضو کرکے صرف نماز کی نیت سے مسجد میں جائے تو اس کے ہر قدم پر نیکی کا اضافہ اور ایک گناہ کی معافی ہوتی چلی جاتی ہے۔ جس کے بارے میں حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے مروی ہے کہ حضور کریم صلی اللہ علیہ وسلم نے فرمایا جب آدمی اچھی طرح وضو کر کے مسجد کی طرف اس طرح جاتا ہےکہ نماز کے علاوہ کوئی دوسری چیز اسے نہیں لے جاتی تو وہ جو قدم بھی اٹھاتا ہے اس کے ذریعے اس کا ایک درجہ بلند کیا جاتا ہے اور ایک گناہ ہلکا کیا جاتا ہے۔ پھر جب وہ نماز پڑھتا ہے تو فرشتے اس پر اس وقت تک سلامتی بھیجتے رہتے ہیں جب تک وہ باوضو رہتا ہے اس کے لئے دعا کرتے رہتے ہیں اے اللہ! اس پر سلامتی بھیج! اے اللہ اس پر رحم فرما۔ تم میں سے ہر ایک جب تک نماز کا انتظار کرتا ہے وہ نماز ہی میں رہتا ہے (بخاری)۔\n\nدوستو! نماز باجماعت کی کیا فضیلت اور ثواب ہے یہ تو آپ پڑھ ہی چکے ہیں لیکن موجودہ دور میں ضرورت اس بات کی ہےکہ ہم تمام ملکر نماز باجماعت کا اہتمام کریں اور دوسرے لوگوں کو بھی اس کے اجر و ثواب سے آگاہ کرکے نماز باجماعت کی ترغیب دلائیں کیونکہ آج ہمارا نوجوان طبقہ ان تمام باتوں سے نا آشنا ہو چکا ہے۔ اس لیے ہم تمام کی ذمہ داری ہےکہ ترغیب دینے کے ساتھ ساتھ تمام امت مسلمہ کے نوجوانوں کے حق میں دعا بھی کریں کہ اللہ پاک جماعت سے نماز نہ پڑھنے والے تمام مسلمانوں کو نماز باجماعت کی پابندی کرنے والا بنا دے۔ آمین۔ *ثم آمین"
},
  {
  "index": "4",
  "name": "نماز میں خشوع وخضوع",
  "body": "عزیز ساتھیو! اس زمانے میں دین کی طرف سے جتنی بے توجہی اور بے التفاتی کی جارہی ہے وہ محتاج بیان نہیں حتیٰ کہ اہم ترین عبادت نماز جو بالاتفاق سب کے نزدیک ایمان کے بعد تمام فرائض پر مقدم ہے اور قیامت میں سب سے اول اسی کا مطالبہ ہوگا۔\n\nعام طور پر تین قسم کے نمازی پائے جاتے ہیں۔ ایک جماعت ان لوگوں کی ہے جو سرے سے نماز کی پرواہ ہی نہیں کرتے، دوسرے وہ جو نماز پڑھتے ہیں لیکن جماعت کا اہتمام نہیں کرتے، تیسرے جو نماز بھی پڑھتے ہیں اور جماعت کا اہتمام بھی کرتے ہیں لیکن لاپرواہی اور بے توجہی سے پڑھتے ہیں۔\n\nدوستو! نماز اللہ کی بڑی رحمت ہے اس لیے مصیبت و آلام کے وقت میں انسان کا اس طرف متوجہ ہو جانا گویا اللہ کی رحمت کی جانب متوجہ ہو جانا ہے اور جب رحمتِ الٰہی مساعد و مددگار ہو تو پھر کیا مجال ہے کسی پریشانی کی کہ باقی رہے۔ اس لئے نماز میں خشوع و خضوع کو بڑی اہمیت حاصل ہے کیونکہ بغیر خشوع و خضوع کے نماز پڑھنے کی بہت وعیدیں ہیں۔ لیکن پھر بھی بہت سے لوگ ایسے ہیں جو باجماعت نماز کا اہتمام کرنے کے باوجود نماز کو لاپرواہی سے پڑھتے ہیں اس لیے وہ نماز بجائے اجروثواب کے ناقص ہونے کی بناء پر منہ پر مار دی جاتی ہے۔ اس کے بالمقابل اچھی طرح سے نماز پڑھنے والوں کے بارے میں ارشاد الٰہی ہے۔\n\nوَاِنَّهَا لَكَبِيْرَةٌ اِلَّا عَلَى الْخَاشِعِيْنَ• اَلَّذِيْنَ يَظُنُّوْنَ اَنَّهُمْ مُّلَاقُوْا رَبِّهِمْ وَاَنَّهُمْ اِلَيْهِ رَاجِعُوْنَ •\nترجمہ۔ بے شک نماز دشوار ہے مگر جن کے دلوں میں خشوع ہے ان پر کچھ دشوار نہیں یہ وہ لوگ ہیں جو خیال رکھتے ہیں کہ بلاشبہ وہ اپنے رب سے قیامت میں ملنے والے ہیں اور مرنے کے بعد اس کی طرف لوٹ کر جانے والے ہیں۔\n\nخشوع وخضوع کا مطلب\n\nخشوع کا مطلب یہ ہے کہ نماز اس طرح پڑھے گویا اللہ تعالی کو دیکھ رہا ہے۔ اگر یہ کیفیت حاصل نہ ہوسکے تو یہ خیال کرتے بھی نماز پڑھے کہ اللہ ہمیں دیکھ رہا ہے۔ عزیز ساتھیو جس طرح زندگی کو بہتر بنانے کے لیے کام اچھی طرح انجام دینا ضروری ہے ٹھیک اسی طرح نماز کو بہتر بنانے کے لئے خشوع کا ہونا نہایت ضروری ہے۔ اس لیے خشوع و خضوع کو اختیار کرنے والے لوگوں کے بارے میں ارشاد ربانی ہے:\n\nقَدْ أَفْلَحَ الْمُؤْمِنُونَ • اَلَّذِينَ هُمْ فِي صَلَاتِهِمْ خَاشِعُونَ•\nترجمہ: یقیناً وہ ایمان والے کامیاب ہوئے جو اپنی نماز میں خشوع کرنے والے ہیں۔\n\nہر وہ چیز جس سے نماز میں دل بٹے مکروہ ہے\n\nہر وہ چیز جس سے نمازی کا دل بٹتا ہو، خدائے پاک کی طرف سے دھیان ہٹ کر کسی مخلوق میں دل الجھتا ہو اسی طرح نمازی کے سامنے دیوار یا مصلے پر نقش و نگار ہونا بدن یا کپڑے سے کھیلنا ہر وہ چیز جس سے یہ لگے کہ وہ نماز نہیں پڑھ رہا ہے، مکروہ ہے۔ لہذا پوری طرح متوجہ ہو کر نماز پڑھنا اور نماز سے باہر خیال نہ جائے یہ خشوع ہے۔\n\nدوستو! جس نماز سے آخرت کا ثواب لینا مقصود ہے، جسے بارگاہ خداوندی میں پیش کرکے جنت حاصل کرنا ہے پھر بھی اس کو انسان بے دھیانی سے پڑھے تو یہ بڑی نالائقی ہے۔ اس لیے کہ نماز ایسی نعمت اور دولت ہے کہ زندگی کا جو وقت نماز میں لگ گیا انمول ہوگیا اور زندگی کا یہ حصہ زندگی کہنے کے قابل ہو گیا اس نماز کو دل لگا کے پڑھنا چاہیے۔\n\nمنافق کی نماز\n\nقرآن مجید میں منافقوں کا حال بیان کرتے ہوئے ارشاد فرمایا: “وَإِذَا قَامُوا إِلَى الصَّلَاةِ قَامُوا كُسَالَىٰ”\nترجمہ: جن نماز کیلئے کھڑے ہوتے ہیں تو سستی کی حالت میں کھڑے ہوتے ہیں۔ نماز پڑھتے وقت طبیعت پر بوجھ جسم پر سستی اور کاہلی سوار مومن کی شایان شان نہیں ہے۔ ایسی نماز منافقوں کی نماز کی نشانی ہے اس لئے نماز میں خشوع و خضوع اور سکون واطمینان رکھنا مومن کے لئے نہایت ضروری ہے۔\n\nنماز میں جھومنا\n\nحضرت ابوبکر صدیق رضی اللہ تعالی عنہ کی اہلیہ فرماتی ہیں کہ میں دن میں نماز پڑھتے ہوئے ادھر ادھر جھکنے لگی، یہ دیکھ کر حضرت ابوبکر صدیق رضی اللہ تعالی عنہ نے اس زور سے ڈانٹا کہ ڈر کی وجہ سے قریب تھا کہ میں نماز توڑ دوں۔ پھر حضرت ابوبکر صدیق رضی اللہ تعالی عنہ نے فرمایا: میں نے رسول صلی اللہ علیہ وسلم سے سنا ہے کہ جب کوئی شخص نماز کے لیے کھڑا ہو تو اپنے تمام بدن کو سکون سے رکھے۔ یہودیوں کی طرح ادھر ادھر کو نہ جھکے کیونکہ نماز میں اعضاء کو سکون سے رکھنا نماز کے پورا ہونے کا جزو ہے۔\n\nدوستو! کامیاب ہیں وہ لوگ جو نماز کو خشوع و خضوع سے پڑھتے ہیں کیونکہ اللہ کی اہم ترین عبادت ان کے لیے دعا کرتی ہے۔ لیکن عام طور پر جو نماز پڑھی جاتی ہے وہ یہ ہے کہ رکوع کیا تو وہیں سے سجدے میں چلے گئے، سجدے سے سر اٹھانے بھی نہ پائے تھے کہ فوراً کوے کی سی ٹھونگ دوسری دفعہ ماردی، ایسے نمازی کیلئے نماز بد دعا کرتی ہے۔\n\nروایات میں آتا ہے کہ جو شخص نماز کو بے وقت کرکے پڑھے اور وضو اچھی طرح نہ کرے، اس میں پوری طرح دل لگا کر رکوع سجدہ پورا ادا نہ کرے تو نماز سیاہ صورت میں وہاں سے رخصت ہوتی ہے اور یہ بد دعا دیتی جاتی ہے کہ اللہ تجھے ضائع کرے جیسا کہ تو نے مجھے ضائع کیا۔ پھر وہ نماز پرانے کپڑوں میں لپیٹ کر نماز پڑھنے والے کے منہ پر مار دی جاتی ہے۔ *اعاذنااللہ من ذلک*\n\nدوستو! مشاہدے سے یہ بات معلوم ہوتی ہے کہ آج کے ہم مسلمانوں کا یہی حال ہے، یہی وجہ ہے کہ آج ہم مسلمان پستی میں ہیں کیونکہ آج ہماری نمازیں خشوع و خضوع سے خالی ہو چکی ہیں۔ اس لئے ضرورت اس بات کی ہے کہ ہم اپنی نمازوں میں خشوع وخضوع پیدا کریں کیونکہ جو نماز خشوع کے ساتھ پڑھی جاتی ہے آسمان کے دروازے اسکے لئے کھل جاتے ہیں، وہ نہایت نورانی ہوتی ہے اور نمازی کیلئے اللہ تعالی شانہٗ کی بارگاہ میں سفارشی بن جاتی ہے۔ تو پھر کیوں نہ ہم اس طریقے سے نماز ادا کریں کہ وہ بارگاہ ایزدی میں روزِ قیامت ہمارے لئے سفارشی بن جائے۔ آخر میں اللہ تعالیٰ سے دعا ہے کہ اللہ ہم تمام کو نماز کو خشوع و خضوع کے ساتھ پڑھنے والا بنائے۔ آمین"
},
  {
  "index": "3",
  "name": "پانچ نمازوں کی فضیلت",
  "body": ""
  }
]
