[
  {
    "index": "1",
    "name": "نماز کی اہمیت",
    "body": "نماز اسلام کا سب سے اہم و اکرم فریضہ ہے۔نماز دین کا ستون ہونے کے ساتھ دل کا نور بھی ہے۔ اس لیے نماز کو *اَلصَّلَاۃُ عِمَادُالِّدیْنٌ* سے تعبیر کیا گیا ہے۔ جس طرح سے عمارت کو قائم رکھنے کیلئے ستون کا ہونا ضروری ہے ٹھیک اسی طرح دین پر قائم رہنے کے لیے نماز کا ہونا اشد ضروری ہے جس کی اہمیت قرآن کی آیت *وَاَقِيْمُوْا الصَّلَاةَ وَاٰتُوْا الَّزكَاةٌ* سے ثابت ہوتی ہے۔ یہی نہیں بلکہ اسلام کے ارکان کا حکم زمین پر رہتے ہی دیا گیا لیکن نماز کے لئے خدائے وحدہ لاشریک نے اہتمام فرمایا کہ رسولِ کریمﷺ کو معراج کی سیر کرا کر عالم بالا میں عطا فرمائی۔
\n
نیز اسلام کے ارکان میں سب سے پہلے نماز فرض ہوئی کیوں کہ نماز جنت کی کنجی ہے۔نماز کے بارے میں حضرت ابوھریرہ رضی اللہ تعالی عنہ سے روایت ہے کہ رسول دو عالمﷺ نے ارشاد فرمایا: “قیامت کے دن بندے کے اعمال کا جو حساب ہوگا ان میں سب سے اوّل نمبر پر نماز ہے۔” سو اگر نماز درست نکلی تو بندہ کامیاب اور بامراد، اگر نماز خراب نکلی تو ناکام ہوگا اور نقصان اٹھائے گا۔
\n
نماز کی ادائیگی مسلمانوں میں نظم و ضبط پیدا کرتی ہے اس لیے ہر بالغ مرد عورت پر لازم ہے کہ وہ نماز کی پابندی کرے کیونکہ نمازی دنیا و آخرت میں سرخرو ہوں گے لیکن ایک وقت کی نماز نہ ادا کرنے پر حضور صلی اللہ علیہ وسلم نے فرمایا کہ جسکی عصر کی (ایک) نماز جاتی رہی( اس کا اس قدر نقصان ہوا کہ) جیسے اس کے اہل و اولاد اور سارا مال ختم ہو گیا ہو۔ اسی پر بس نہیں بلکہ امام ابن القیم رحمۃ اللہ علیہ فرماتے ہیں کہ بندے کو اللہ کے سامنے دو مرتبہ کھڑا ہونا ہے۔ لہذا جو شخص نماز کی حالت میں اللہ کے سامنے کھڑا ہونے کا حق ادا کر دیتا ہے اسکے لیے قیامت کے دن کا کھڑا ہونا آسان ہوگا اور جو شخص نماز والے قیام کا حق ادا نہیں کرتا اسکے لیے قیامت کے دن والا قیام انتہائی سخت ہوگا۔
\n\n
نماز کے فوائد
\n
نماز سے انسان کو روحانی سکون کے ساتھ ساتھ جسمانی فوائد بھی حاصل ہوتے ہیں اسی کی بنا پر انسان پاک و صاف رہنے کے ساتھ ساتھ کئی بیماریوں سے محفوظ بھی رہتا ہے۔ نماز انسان کو بےحیائی،برائی، نشے کی عادت نیز تمام برائیوں سے روکتی ہے جس کو قرآن نے کچھ اسطرح بیان کیا ہے *اِنَّ اَلصَّلَاۃَ تَنْهٰى عَنِ الْفَحْشَاءِ وَالْمُنْكَرْ* ترجمہ: “بے شک نماز بے حیائی اور بری باتوں سے روکتی ہے”
\n
ضرورت اس بات کی ہےکہ ہم نماز کو خلوصِ دل سے ادا کریں کیونکہ یہ نزولِ رحمت کے ساتھ جہنم سے نجات کا پروانہ بھی ہے۔ یہ مومن اور کافر میں فرق کو واضح کرتی ہے۔ جس کے بارے میں آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا کہ نماز مومن اور کافر کے درمیان حد فاصل ہے۔ لہٰذا جو بھی نماز کو دھیان اور توجہ سے پڑھیں گے ان کو خدا کی جانب سے رحمت اور عنایت حاصل ہوگی جو قرآن کی آیت *اُولِٰئِكَ عَلَيْهِمْ صَلَوٰةٌ مِّنْ رَّبِّهِمْ وَرَحْمَةٌ وَ اُولٰئِكَ هُمُ الْمُهْتَدُوْنَ* سے ثابت ہے۔
\n\n
نماز کا اجروثواب
\n
عزیز ساتھیو! ذرا سوچئیے کہ وہ حقیقی مالک جو ہمارے گناہوں کے باوجود ہمیں اپنی نعمتوں سے محروم نہیں کرتا تو نماز کا ثواب کتنا ہوگا ہے، یہ اندازہ کرنا مشکل ہی نہیں بلکہ ناممکن ہے۔ اس لیے نماز قائم کرنے والوں کو قرآن میں جابجا بشارت سنائی گئی ہے۔ ارشاد ربانی ہے*اِنَّ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصَّالِحٰتِ وَاَقَامُوا الصَّلَاۃَ وَاٰتُوا الَّزكٰوةَ لَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُوْنَ*ترجمہ۔ “وہ لوگ جو ایمان لائے نیک عمل کیے، نماز قائم کیے اور زکوٰۃ ادا کیے وہ اپنے رب کے پاس اپنے اجر کے مستحق ہوں گے، نہ انہیں کوئی خوف لاحق ہوگا نہ انہیں کوئی غم پہنچے گا”۔دوستو! اس آیت میں بھی یہ واضح نہیں کیا گیا کہ کتنا اجر ہوگا۔ حضرت جبرئیل علیہ السلام فرماتے ہیں چھ مہینے بارش ہوتی رہے میں بارش کے ہر قطرے کو گن سکتا ہوں مگر جب نمازی اللہ کے سامنے کھڑا ہوتا ہے تو اسکی نیکیاں نہیں گن سکتا کیونکہ جب نمازی رکوع میں جاتا ہے تو پورے جسم کے برابر سونا خرچ کرنے کے برابر اجر پاتا ہے۔
\n
اسی طرح جب نمازی ایک دفعہ اَللّٰہُ اَکْبَرْ کہتا ہے تو ایک اونٹ ذبح کرکے اسکو غرباء و مساکین میں تقسیم کرنے کے برابر اجر ہے۔ ذراغورکیجئے کہ جب اللہ اکبر کہنے پر اتنا ثواب ملتا ہے مکمل نماز پڑھنے کا ثواب کتنا ملے گا؟ اسکا شمار کرنا ممکن ہی نہیں بلکہ مشکل بھی ہے اور جب نمازی سجدے میں جاتا ہے تو انتہا ہو جاتی ہے کیونکہ انسان کو اللہ نے غیرت اور عزتِ نفس بھی دی ہے۔ اس لئے انسان ناک، ماتھے اور پیشانی کیلیے عجیب فیصلے کرلیتا ہے لیکن اللہ کا نظام تو دیکھیے کہ جب بندہ سجدے میں جاتا ہے تو یہ تمام چیزیں مٹی میں ملا دیتا ہے اور بندہ اللہ کے سامنے ناک اور پیشانی رگڑ رہا ہوتا ہے اس وقت میرا اللہ کہتا ہے کہ اس کو عزت و وقار کا شعور دیا اس نے اپنی عزت اور شان و شوکت سب کچھ میرے سامنے نچھاور کر دی۔ تو اس وقت سجدے میں خود رب مل جاتا ہے اس لیے ہم اس کے اجروثواب کو شمار نہیں کرسکتے کیونکہ جب وہ خالق و مالک اپنے بندوں کو بلاوجہ اتنا سب کچھ عطا کر دیتا ہے تو میرا اندازہ ہے کہ وہ نماز کے ادا کرنے پر بے شمار اجروثواب عطا کرے گا۔ انشاءاللہ۔
\n
آخر میں اللہ سے دعا ہے کہ اللہ ہم تمام کو نماز کی اہمیت ،فوائد اور اجروثواب کو سمجھ کر اس پر مستقل عمل پیرا ہونے کی توفیق عطا فرمائے آمین۔"
},
  {
    "index": "2",
    "name": "نماز کی اہمیت",
    "body": ""
},
]
