[
  {
    "title": "محبت کے لیے وظیفہ",
    "dua": "يَا وَدُودُ",
    "translation": "اے بہت محبت کرنے والے (اللہ)!",
    "detail": "اگر دل میں کسی کے لیے جائز محبت ہو، جیسے شوہر بیوی کے درمیان یا کسی رشتہ دار کے ساتھ تعلق بہتر کرنا ہو... شرط یہ ہے کہ نیت جائز ہو، دل میں حسد، انتقام یا غلط ارادہ نہ ہو۔"
  },
  {
    "title": "امتحان میں کامیابی کا وظیفہ",
    "dua": "رَبِّ زِدْنِي عِلْمًا",
    "translation": "اے میرے رب! میرے علم میں اضافہ فرما۔",
    "detail": "یہ دعا سورۃ طٰہٰ میں نازل ہوئی... اس کے ساتھ محنت اور نیت صاف ہونی چاہیے۔"
  },
  {
    "title": "رزق میں برکت کے لیے وظیفہ",
    "dua": "يَا رَزَّاقُ",
    "translation": "اے بہت رزق دینے والے (اللہ)!",
    "detail": "اگر آپ روزی میں تنگی محسوس کر رہے ہیں... اللہ سے دعا کریں کہ وہ حلال اور وسیع رزق عطا فرمائے۔"
  },
  {
    "title": "دل کا سکون اور بےچینی ختم کرنے کا وظیفہ",
    "dua": "أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ",
    "translation": "خبردار! دلوں کا سکون صرف اللہ کے ذکر سے ہی ملتا ہے۔",
    "detail": "اگر دل بے چین رہتا ہے، نیند نہیں آتی یا پریشان خیالات آتے ہیں... اللہ کے قرب کا احساس ہوگا۔"
  },
  {
    "title": "دشمن سے حفاظت کا وظیفہ",
    "dua": "حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
    "translation": "اللہ ہمارے لیے کافی ہے اور وہی بہترین کارساز ہے۔",
    "detail": "اگر آپ کو کسی کی طرف سے خطرہ، حسد یا سازش محسوس ہو رہی ہو... اللہ پر کامل بھروسہ رکھیں۔"
  },
  {
    "title": "اولاد کی نیکی کے لیے وظیفہ",
    "dua": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي",
    "translation": "اے میرے رب! مجھے اور میری اولاد کو نماز قائم کرنے والا بنا۔",
    "detail": "یہ دعا حضرت ابراہیمؑ کی ہے... یہ وظیفہ دل میں سکون اور اولاد میں نیکی کی بنیاد ڈالنے کا ذریعہ بن سکتا ہے۔"
  },
  {
    "title": "نیا کام شروع کرنے سے پہلے کا وظیفہ",
    "dua": "بِسْمِ اللَّهِ الرَّحْمَـٰنِ الرَّحِيمِ",
    "translation": "اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
    "detail": "نبی ﷺ نے فرمایا: 'جو کام اللہ کے نام سے شروع نہ کیا جائے... یہ وظیفہ برکت، تحفظ اور حسنِ انجام کا ذریعہ بنتا ہے۔"
  },
  {
    "title": "حوائج کی تکمیل کے لیے وظیفہ",
    "dua": "يَا مُجِيبُ",
    "translation": "اے دعا قبول کرنے والے (اللہ)!",
    "detail": "'المُجیب' اللہ کا صفاتی نام ہے... اس کے ساتھ صدقہ دیں تو اثر دوگنا ہو جاتا ہے۔"
  },
  {
    "title": "بے اولادی کے لیے وظیفہ",
    "dua": "رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ",
    "translation": "اے میرے رب! مجھے اکیلا نہ چھوڑ، اور تو سب سے بہتر وارث ہے۔",
    "detail": "یہ دعا حضرت زکریاؑ کی ہے... اللہ جس کو چاہے، بے حساب عطا فرماتا ہے۔"
  },
  {
    "title": "گھریلو جھگڑوں اور بے برکتی کے لیے وظیفہ",
    "dua": "يَا سَلَامُ",
    "translation": "اے سلامتی دینے والے (اللہ)!",
    "detail": "اگر گھر میں لڑائی جھگڑا رہتا ہے... دل نرم ہوتے ہیں، اور رحمت نازل ہوتی ہے۔"
  }
]
