{
  "type": "Wazifa",
  "items": [
  {
    "title": "محبت کے لیے وظیفہ",
    "dua": "يَا وَدُودُ",
    "translation": "اے بہت محبت کرنے والے (اللہ)!",
    "detail": "اگر دل میں کسی کے لیے جائز محبت ہو، جیسے شوہر بیوی کے درمیان یا کسی رشتہ دار کے ساتھ تعلق بہتر کرنا ہو، تو یہ اسمِ مبارک 'يَا وَدُودُ' روزانہ نماز عشاء کے بعد 300 مرتبہ دل سے پڑھیں۔ 'الودود' اللہ کا صفاتی نام ہے، جیسا کہ سورۃ ہود (11:90) میں آیا ہے۔ اس وظیفے کے ساتھ اللہ سے دعا کریں کہ دلوں میں محبت اور الفت ڈال دے۔ شرط یہ ہے کہ نیت جائز ہو، دل میں حسد، انتقام یا غلط ارادہ نہ ہو۔"
  },
  {
    "title": "امتحان میں کامیابی کا وظیفہ",
    "dua": "رَبِّ زِدْنِي عِلْمًا",
    "translation": "اے میرے رب! میرے علم میں اضافہ فرما۔",
    "detail": "یہ دعا قرآن مجید کی سورۃ طٰہٰ (20:114) میں نازل ہوئی، جس میں اللہ تعالیٰ نے نبی ﷺ کو علم کے اضافے کی دعا سکھائی۔ طالب علم کے لیے یہ بہت مؤثر وظیفہ ہے۔ روزانہ فجر یا عشاء کے بعد 100 بار یہ دعا پڑھیں اور پھر دعا کریں کہ اللہ آپ کے علم میں برکت عطا کرے، یادداشت تیز کرے، اور امتحان میں آسانی دے۔ اس کے ساتھ محنت اور نیت صاف ہونی چاہیے۔"
  },
  {
    "title": "رزق میں برکت کے لیے وظیفہ",
    "dua": "يَا رَزَّاقُ",
    "translation": "اے بہت رزق دینے والے (اللہ)!",
    "detail": "اگر آپ روزی میں تنگی محسوس کر رہے ہیں یا کاروبار میں برکت نہیں ہو رہی، تو اللہ کا یہ صفاتی نام 'يَا رَزَّاقُ' روزانہ بعد نماز فجر 313 بار پڑھیں۔ 'الرزاق' اللہ کا صفاتی نام ہے، جیسا کہ سورۃ الذاریات (51:58) میں فرمایا: 'إِنَّ اللَّهَ هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ'۔ اس وظیفے سے رزق میں کشادگی، حلال کمائی، اور برکت پیدا ہوتی ہے۔"
  },
  {
    "title": "دل کا سکون اور بےچینی ختم کرنے کا وظیفہ",
    "dua": "أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ",
    "translation": "خبردار! دلوں کا سکون صرف اللہ کے ذکر سے ہی ملتا ہے۔",
    "detail": "یہ آیت قرآن مجید کی سورۃ الرعد (13:28) میں ہے۔ اگر دل بے چین رہتا ہے، نیند نہیں آتی یا پریشان خیالات آتے ہیں، تو روزانہ سونے سے پہلے 100 مرتبہ اس آیت کو آرام دہ حالت میں دل سے پڑھیں۔ آہستہ آہستہ دل کو سکون ملے گا، ذہنی دباؤ کم ہوگا، اور اللہ کے قرب کا احساس ہوگا۔"
  },
  {
    "title": "دشمن سے حفاظت کا وظیفہ",
    "dua": "حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
    "translation": "اللہ ہمارے لیے کافی ہے اور وہی بہترین کارساز ہے۔",
    "detail": "یہ آیت سورۃ آل عمران (3:173) سے لی گئی ہے۔ اگر آپ کو کسی کی طرف سے خطرہ، حسد یا سازش محسوس ہو رہی ہو، تو روزانہ فجر اور مغرب کے بعد 450 مرتبہ دل سے پڑھیں۔ صحابہ کرامؓ نے یہ دعا دشمنوں کے مقابلے پر پڑھی تھی۔ اللہ پر کامل بھروسہ رکھیں اور دعا کریں کہ وہ آپ کو ہر دشمن اور شر سے محفوظ رکھے۔"
  },
  {
    "title": "اولاد کی نیکی کے لیے وظیفہ",
    "dua": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي",
    "translation": "اے میرے رب! مجھے اور میری اولاد کو نماز قائم کرنے والا بنا۔",
    "detail": "یہ دعا حضرت ابراہیمؑ کی ہے جو سورۃ ابراہیم (14:40) میں مذکور ہے۔ روزانہ نماز کے بعد 100 مرتبہ یہ دعا پڑھیں اور اپنی اولاد کے حق میں نیک دعا کریں۔ یہ وظیفہ دل میں سکون اور اولاد میں نیکی کی بنیاد ڈالنے کا ذریعہ بن سکتا ہے۔"
  },
  {
    "title": "نیا کام شروع کرنے سے پہلے کا وظیفہ",
    "dua": "بِسْمِ اللَّهِ الرَّحْمَـٰنِ الرَّحِيمِ",
    "translation": "اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
    "detail": "نبی ﷺ نے فرمایا: 'كل أمر ذي بال لا يبدأ فيه ببسم الله فهو أبتر' — یعنی 'جو کام اللہ کے نام سے شروع نہ کیا جائے وہ بے برکت ہوتا ہے۔' (سنن ابن ماجہ: 1894)۔ کوئی نیا کام شروع کریں — کاروبار، تحریر، سفر — تو 7 یا 21 مرتبہ یہ دعا پڑھیں۔ یہ وظیفہ برکت، تحفظ اور حسنِ انجام کا ذریعہ بنتا ہے۔"
  },
  {
    "title": "حوائج کی تکمیل کے لیے وظیفہ",
    "dua": "يَا مُجِيبُ",
    "translation": "اے دعا قبول کرنے والے (اللہ)!",
    "detail": "'المُجِيب' اللہ تعالیٰ کا صفاتی نام ہے، جو سورۃ ہود (11:61) میں آیا ہے: 'إِنَّهُ قَرِيبٌ مُّجِيبٌ'۔ اگر آپ کی کوئی خاص حاجت ہے — قرض، شادی، بیماری — تو روزانہ تہجد یا عشاء کے بعد 500 مرتبہ 'يَا مُجِيبُ' پڑھیں۔ دعا مانگتے وقت عاجزی، یقین اور آنسو ہوں، اور صدقہ دیں تو اثر دوگنا ہو جاتا ہے۔"
  },
  {
    "title": "بے اولادی کے لیے وظیفہ",
    "dua": "رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ",
    "translation": "اے میرے رب! مجھے اکیلا نہ چھوڑ، اور تو سب سے بہتر وارث ہے۔",
    "detail": "یہ دعا حضرت زکریاؑ کی ہے، جو سورۃ الأنبياء (21:89) میں آئی ہے۔ اگر کسی جوڑے کے ہاں اولاد نہیں ہو رہی تو دونوں میاں بیوی بعد نماز مغرب 121 بار یہ دعا پڑھیں۔ یقین، صبر اور دوا کے ساتھ یہ وظیفہ اللہ کی طرف رجوع کا ذریعہ ہے۔"
  },
  {
    "title": "گھریلو جھگڑوں اور بے برکتی کے لیے وظیفہ",
    "dua": "يَا سَلَامُ",
    "translation": "اے سلامتی دینے والے (اللہ)!",
    "detail": "'السلام' اللہ تعالیٰ کا صفاتی نام ہے جیسا کہ سورۃ الحشر (59:23) میں آیا ہے: 'هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ'۔ اگر گھر میں لڑائی جھگڑا رہتا ہے یا دل نہیں ملتے، تو روزانہ صبح و شام 111 بار یہ وظیفہ پڑھیں۔ اس کے اثر سے گھر کا ماحول بدلتا ہے، دل نرم ہوتے ہیں اور رحمت نازل ہوتی ہے۔"
  }
]
}
